# %%
import cv2 as cv


import pandas as pd
# %%
def list_lines_to_df(list_lines):
    


# ایده اینه که خطوط رو بدیم به دیتا فریم‌ها و بعد خروجی هر دفعه که تصویر جدید رو چک می‌کردیم با دیتا فریم اصلی مقایسه کنیم.
# از پایین ترین خط هر تصویر شروع می‌کنیم به بالا رفتن و با خطوط ذخیره شده توی دیتا فریم اولیه بازم از پایین به بالا مقایسه می‌کنیم. تا مشابهت کامل پیدا کنیم.
# باید یک حدی بذاریم که کل دیتا فریم اولیه رو تا تهش بالا نره و از یک جا به بعد پشیمون بشه.
# بعد که فهمیدیم مثلا خط ۴ ام از تصویر جدید ما خط ۶۰ ام از کل خطوط استخراج شده هست و تصویر فعلی ۱۰ خط داره خطوط ۵ تا ۱۰ رو به عنوان خطوط ۶۱ تا ۶۶ دیتا فریم اولیه تعریف می‌کنیم.
#
#
#

